# Manipulação de dados ausentes

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({
    'A': [1, 2, np.nan],
    'B': [5, np.nan,np.nan],
    'C': [1,2,3]})

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [9]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [10]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [15]:
df.fillna('Conteúdo')

          A         B  C
0       1.0       5.0  1
1       2.0  Conteúdo  2
2  Conteúdo  Conteúdo  3

In [17]:
df['A'].mean()

1.5

In [16]:
df['A'  ].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [18]:
df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [19]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [21]:
df.bfill() # Preencher com último valor conhecido

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# Groupby

In [23]:
import pandas as pd
#Cria um DataFrame
data = {'Classe':['Júnior', 'Júnior', 'Pleno', 'Pleno', 'Sênior', 'Sênior'],
        'Nome': ['Jorge', 'Carlos', 'Roberta', 'Patrícia', 'Bruno', 'Vera'],
        'Venda' : [200,120, 340, 124, 243, 350]}

In [24]:
df = pd.DataFrame(data)

In [25]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [45]:
group = df.groupby('Classe')

In [42]:
df.groupby("Classe").sum(numeric_only=True)

        Venda
Classe
Júnior    320
Pleno     464
Sênior    593

In [43]:
df.groupby("Classe").mean(numeric_only=True)

        Venda
Classe
Júnior  160.0
Pleno   232.0
Sênior  296.5

In [48]:
df.groupby("Classe").min()

            Nome  Venda
Classe
Júnior    Carlos    120
Pleno   Patrícia    124
Sênior     Bruno    243

In [49]:
df.groupby("Classe").max()

           Nome  Venda
Classe
Júnior    Jorge    200
Pleno   Roberta    340
Sênior     Vera    350

In [52]:
df2 = df.copy()

In [53]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [54]:
df2['Venda'] = [150, 432, 190, 230, 410, 155]

In [55]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [56]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [57]:
df3 = pd.concat([df, df2], ignore_index=True)

In [58]:
df3

    Classe      Nome  Venda
0   Júnior     Jorge    200
1   Júnior    Carlos    120
2    Pleno   Roberta    340
3    Pleno  Patrícia    124
4   Sênior     Bruno    243
5   Sênior      Vera    350
6   Júnior     Jorge    150
7   Júnior    Carlos    432
8    Pleno   Roberta    190
9    Pleno  Patrícia    230
10  Sênior     Bruno    410
11  Sênior      Vera    155

In [60]:
df3.groupby(["Classe", "Nome"]).sum()

                 Venda
Classe Nome
Júnior Carlos      552
       Jorge       350
Pleno  Patrícia    354
       Roberta     530
Sênior Bruno       653
       Vera        505